{
  "userId": "fecfdcf120f658c3",
  "email": "akash.singh.0762@gmail.com",
  "generatedAt": "2025-11-01T00:35:06.402Z",
  "mode": "recent",
  "sections": [
    "technology"
  ],
  "articleCount": 5,
  "articles": [
    {
      "id": "technology/2025/oct/28/alan-turing-institute-launches-new-mission-to-protect-uk-from-cyber-attacks",
      "title": "Alan Turing institute launches new mission to protect UK from cyber-attacks ",
      "webUrl": "https://www.theguardian.com/technology/2025/oct/28/alan-turing-institute-launches-new-mission-to-protect-uk-from-cyber-attacks",
      "apiUrl": "https://content.guardianapis.com/technology/2025/oct/28/alan-turing-institute-launches-new-mission-to-protect-uk-from-cyber-attacks",
      "section": "technology",
      "publishedDate": "2025-10-28T13:29:39Z",
      "trailText": "Programme is designed to defend energy, transport and utilities amid concern over vulnerability to internet outages",
      "summary": "UK's Alan Turing Institute unveiled a mission to defend energy, transport and utilities from cyberattacks and outages, amid a strategic overhaul after staff unrest and CEO Jean Innes's resignation. Chair Doug Gurr said 78 projects at the 440-staff institute were closed, spun out or completed to align with the new focus. Former air and space warfare commander Blythe Crawford will report next month on supporting defence, security and intelligence. The institute will use AI to forecast weather, oceans and sea ice, cut emissions in networks and manufacturing, and build cardiac digital twins. Move follows AWS outage and attacks disrupting JLR, M&S and Co-op.",
      "summaryTokens": 3309,
      "generatedAt": "2025-10-28T14:39:39.720Z",
      "_section": "technology",
      "score": 0,
      "error": "OpenAI API error: Unsupported value: 'temperature' does not support 0.3 with this model. Only the default (1) value is supported."
    },
    {
      "id": "technology/2025/oct/27/ai-tech-donald-trump-san-francisco",
      "title": "Tech chiefs tell Trump to call off troops – will Firefox go ‘full AI’?",
      "webUrl": "https://www.theguardian.com/technology/2025/oct/27/ai-tech-donald-trump-san-francisco",
      "apiUrl": "https://content.guardianapis.com/technology/2025/oct/27/ai-tech-donald-trump-san-francisco",
      "section": "technology",
      "publishedDate": "2025-10-28T13:22:19Z",
      "trailText": "In this week’s newsletter: Silicon Valley billionaires have a hotline to the US president. Plus, the head of Firefox talks AI-integrated browsers, and more",
      "summary": "TechScape surveys AI-first browsers—OpenAI’s ChatGPT Atlas, Edge’s Copilot Mode, Perplexity’s free Comet, and Chrome with Gemini—and presses Firefox GM Anthony Enzor-DeMeo on going “full AI,” agentic browsing, and privacy. Trump dropped a National Guard “surge” into San Francisco after calls from Nvidia’s Jensen Huang and Salesforce’s Marc Benioff (who reversed comments during Dreamforce); tech donors are also funding a new White House ballroom (Google, Apple, Palantir). AWS’s outage stemmed from an empty DNS record in US-East-1 that crippled DynamoDB and services like Signal until manual repair. Tinder is expanding face-scan signup checks in the US, Australia, Canada, and India, with Hinge next—stoking biometric privacy vs safety debates.",
      "summaryTokens": 1673,
      "generatedAt": "2025-10-28T14:39:39.720Z",
      "_section": "technology",
      "score": 0,
      "error": "OpenAI API error: Unsupported value: 'temperature' does not support 0.3 with this model. Only the default (1) value is supported."
    },
    {
      "id": "technology/2025/oct/27/amazon-corporate-jobs-cuts",
      "title": "Amazon confirms plans to lay off 14,000 corporate workers as part of wave of cuts",
      "webUrl": "https://www.theguardian.com/technology/2025/oct/27/amazon-corporate-jobs-cuts",
      "apiUrl": "https://content.guardianapis.com/technology/2025/oct/27/amazon-corporate-jobs-cuts",
      "section": "technology",
      "publishedDate": "2025-10-28T12:30:46Z",
      "trailText": "Retail giant, which is vying to reverse pandemic hiring spree, attempts to cut costs and slim down its operation",
      "summary": "Amazon confirmed 14,000 corporate layoffs, reversing pandemic hiring to cut costs and “remove layers,” per SVP Beth Galetti. The cuts—material within ~350,000 corporate staff but small versus 1.55m total—span HR (People Experience & Tech), devices/services, and operations; Fortune says up to 15% of HR. Reuters/WSJ earlier flagged as many as 30,000 roles. CEO Andy Jassy says AI agents will reduce white-collar needs; further efficiencies are eyed into 2026. Shares rose 1.2% Monday. Managers trained Monday; email notifications start Tuesday.",
      "summaryTokens": 1309,
      "generatedAt": "2025-10-28T14:39:39.720Z",
      "_section": "technology",
      "score": 0,
      "error": "OpenAI API error: Unsupported value: 'temperature' does not support 0.3 with this model. Only the default (1) value is supported."
    },
    {
      "id": "technology/2025/oct/28/elon-musk-grokipedia",
      "title": "Elon Musk launches encyclopedia ‘fact-checked’ by AI and aligning with rightwing views",
      "webUrl": "https://www.theguardian.com/technology/2025/oct/28/elon-musk-grokipedia",
      "apiUrl": "https://content.guardianapis.com/technology/2025/oct/28/elon-musk-grokipedia",
      "section": "technology",
      "publishedDate": "2025-10-28T12:15:44Z",
      "trailText": "Grokipedia’s entries hew closely to conservative talking points, with some journalists already saying it contains inaccurate information",
      "summary": "Elon Musk launched Grokipedia, an AI-run encyclopedia “fact-checked” by his Grok chatbot and positioned as a right-leaning alternative to Wikipedia. Many entries cite Wikipedia but lack human authors. Musk says the idea came from Trump administration AI/crypto czar David Sacks. Pages mirror conservative talking points: the Jan 6 entry cites “widespread claims of voting irregularities,” downplays Trump’s role, and alleges mainstream sources inflate casualties/intent. Journalists already flag inaccuracies (e.g., pornography worsened the AIDS epidemic). The launch follows Musk’s attacks on mainstream media and X’s boost of right/far-right voices. He briefly led Trump’s DOGE (ended April); an August Gallup poll ranked him most disliked.",
      "summaryTokens": 950,
      "generatedAt": "2025-10-28T14:39:39.720Z",
      "_section": "technology",
      "score": 0,
      "error": "OpenAI API error: Unsupported value: 'temperature' does not support 0.3 with this model. Only the default (1) value is supported."
    },
    {
      "id": "technology/2025/oct/28/firefox-ai-internet-anthony-enzor-demeo",
      "title": "‘A good moment in time for us’: Firefox head on AI browsers and what’s next for the web",
      "webUrl": "https://www.theguardian.com/technology/2025/oct/28/firefox-ai-internet-anthony-enzor-demeo",
      "apiUrl": "https://content.guardianapis.com/technology/2025/oct/28/firefox-ai-internet-anthony-enzor-demeo",
      "section": "technology",
      "publishedDate": "2025-10-28T09:30:23Z",
      "trailText": "After the release of a slew of other AI-integrated browsers, Anthony Enzor-DeMeo discusses ChatGPT Atlas, the Google monopoly trial – and the future",
      "summary": "Firefox GM Anthony Enzor-DeMeo on AI browsers (ChatGPT Atlas, Edge Copilot Mode, Chrome with Gemini, Perplexity Comet): shift from links to agent answers; citations matter. He warns AI costs could push the web behind paywalls. Firefox will add AI cautiously: opt-in; side panel lets users pick Copilot, Gemini, or Perplexity; no lock-in. Paid AI ~3%; models for revenue and willingness to pay remain unsettled, vary by country. Firefox struck a Perplexity deal (undisclosed) alongside Google default and ~50 search options. Privacy stays user-controlled (no login, private browsing). Generational differences on personalization. Google antitrust ruling preserved search payments; AI-search monetization unresolved. Firefox has ~200M users; sees AI choice as growth.",
      "summaryTokens": 1096,
      "generatedAt": "2025-10-28T14:39:39.720Z",
      "_section": "technology",
      "score": 0,
      "error": "OpenAI API error: Unsupported value: 'temperature' does not support 0.3 with this model. Only the default (1) value is supported."
    }
  ]
}